Revit 2024 API
RebarConstraintsManager.GetCurrentConstraintOnHandle Method
 Retrieves the RebarConstraint that acts on the specified RebarConstraintHandle.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public RebarConstraint GetCurrentConstraintOnHandle(
	RebarConstrainedHandle handle
)
Visual Basic
Public Function GetCurrentConstraintOnHandle ( _
	handle As RebarConstrainedHandle _
) As RebarConstraint
Visual C++
public:
RebarConstraint^ GetCurrentConstraintOnHandle(
	RebarConstrainedHandle^ handle
)
Parameters
handle
Type: Autodesk.Revit.DB.Structure.RebarConstrainedHandle
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  handle is no longer valid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The RebarConstraintsManager does not manage a valid Rebar element.
See Also
RebarConstraintsManager Class
Autodesk.Revit.DB.Structure Namespace